import Header from "../common/Header";
import InfoCard from "../common/InfoCard";
import "../../styles/screens/PrivacyPolicy.css";
import { useNavigate } from "react-router-dom";

const PrivacyPolicy = () => {
  const navigate = useNavigate();
  return (
    <div className="privacy-policy">
      <Header />
      <InfoCard
        title="प्राइवेसी पॉलिसी (Privacy Policy)"
        buttonLabel="होम पेज पर वापस जाएं"
        buttonColor="#d32f2f"
        onButtonClick={() => navigate("/")}
      >
        <p>
          हम आपकी गोपनीयता (Privacy) का सम्मान करते हैं।{" "}
          <span style={{ fontWeight: "bold" }}>Satta Matka DPBoss</span>{" "}
          (SattaMatkaDpboss.Mobi) की प्राइवेसी पॉलिसी इस प्रकार है:
        </p>

        <h3>1. डेटा सुरक्षा और गोपनीयता</h3>
        <p>
          हम अपने विज़िटर्स से किसी भी प्रकार की संवेदनशील निजी जानकारी (जैसे
          बैंक खाता संख्या, आधार कार्ड या फोन नंबर) नहीं मांगते हैं। हमारी
          वेबसाइट पर आपकी पहचान और डेटा पूरी तरह सुरक्षित है।
        </p>

        <h3>2. विज्ञापन और बाहरी लिंक</h3>
        <p>
          हमारी वेबसाइट पर कुछ चुनिंदा तीसरे पक्ष के विज्ञापन या बाहरी एप्लीकेशन
          (जैसे सट्टा प्लेइंग एप्स) के लिंक दिए जा सकते हैं। इन लिंक पर क्लिक
          करना और उन ऐप्स को डाउनलोड करना पूरी तरह से आपका निजी निर्णय है। हम उन
          बाहरी वेबसाइटों या ऐप्स की सामग्री और उनकी सेवाओं के लिए किसी भी तरह
          से जिम्मेदार नहीं हैं।
        </p>

        <h3>3. कुकीज़ (Cookies)</h3>
        <p>
          हम अपनी साइट के यूजर एक्सपीरियंस को बेहतर बनाने के लिए कुकीज़ का उपयोग
          कर सकते हैं। ये कुकीज़ आपके ब्राउज़र में स्टोर होती हैं लेकिन यह आपकी
          निजी जानकारी को ट्रैक नहीं करतीं। आप चाहें तो अपने ब्राउज़र की सेटिंग
          से कुकीज़ को बंद कर सकते हैं।
        </p>

        <h3>4. आयु सीमा (Age Limit)</h3>
        <p>
          यह वेबसाइट केवल 18 वर्ष या उससे अधिक आयु के व्यक्तियों के लिए बनाई गई
          है। यदि आप नाबालिग हैं, तो कृपया तुरंत इस वेबसाइट को छोड़ दें।
        </p>

        <h3>5. पॉलिसी में बदलाव</h3>
        <p>
          हम समय-समय पर अपनी प्राइवेसी पॉलिसी में बदलाव कर सकते हैं। हम अनुशंसा
          करते हैं कि आप नियमित रूप से इस पेज को चेक करते रहें।
        </p>
      </InfoCard>
    </div>
  );
};

export default PrivacyPolicy;
